<style lang="css">
@import './css/base.css';
@import './css/help.css';
</style>
<template>
    <div class="help">
        <div class="help-in">
            <div class="title">
                <h1 class="tc fn">龙泉大藏经校勘平台</h1>
                <h2 class="tc fn">用户操作说明</h2>
            </div>
            <div class="help-main">
            	<h3>1.文字校对</h3>
            	<p>文字校对的目的是为了将藏经图片转化为相应的文字。与传统逐字校对的方式不同，利用基于人工智能的古籍OCR技术可以快速有效的将图片转化为对应的文字，在此基础上人工进行查漏补缺，即可得到一份高质量的校对文本。</p>
            	<p>校对过程如下：</p>
            	<p class="tc"><img width="350" src="./images/h1.png" alt=""></p>
            	<p>文字校对以卷为基本单位。同一卷经的OCR文本分别与CBETA和高丽藏文本进行比对，生成校一、校二两个并行任务，然后针对校一、校二的差异，生成一个审定任务，经过审定得到最终电子文本。</p>
            	<h4>1.1操作界面</h4>
            	<p class="tc" ><img width="920" src="./images/h2.png" alt=""></p>
            	<p>上图中，左边是图像区域，右边是文字操作区域。</p>
            	<p>"<em class="fb">1</em>"：文字操作功能区。</p>
            	<p class="retract">1.完成。表示任务已经做完，提交系统。</p>
            	<p class="retract">2.后一个（快捷键为Tab）。表示当前光标处之后，第一个未完成的差异文本（简称"异文"）。所有未处理的异文显示为红色，已处理的显示为绿色。</p>
            	<p class="retract">3.前一个（快捷键为Shift+Tab）。表示当前光标之前，第一个未完成的异文。</p>
            	<p class="retract">4.删除符。删除符是指当异文中OCR或者选择结果为空时，文本中以半个字符长度的红色或者绿色空块表示。通过这个功能可以显示或隐藏这些删除符。</p>
            	<p class="retract">5.换行符。显示或者隐藏换行符号。</p>
            	<p class="retract">6.存疑。当用户针对某些字的校对结果怀疑时，可以用鼠标选中所怀疑的一个或多个文字，然后点击"存疑"按钮，此时系统会弹框提示用户输入存疑理由。确定后，区域"<em class="fb">4</em>"将保存存疑理由。</p>
            	<p>"<em class="fb">2</em>"：文字区。红色表示未处理的异文，绿色表示已处理的异文，黑色表示OCR和比对本文字相同。用户可以修改任意文字——如果发现黑色文字有误，也可以修改。</p>
            	<p>"<em class="fb">3</em>"：异文弹框。弹框中分列显示OCR、比对本以及选择结果的文字。用户可以点选OCR、比对本，也可以手工输入或者对选择结果进行修改。</p>
            	<p>"<em class="fb">4</em>"：存疑结果区。可以展开或收缩。</p>
            	<p class="tc" ><img src="./images/h3.png" alt=""></p>
				<p>"<em class="fb">5</em>"：图像高亮字。图像区域的高亮字块和文字区域当前光标之后的文字对应。</p>
				<p>"<em class="fb">6</em>"：图像缩放按钮。</p>
				<h4>1.2主要场景</h4>
				<h5>1.2.1选择OCR字</h5>
				<p class="tc"><img width="920" src="./images/h4.png" alt=""></p>
				<p>如上图中，左侧图片为"經"字，因此点选OCR文本"經"。</p>
				<h5>1.2.2选择比对本字</h5>
				<p class="tc"><img width="920" src="./images/h5.png" alt=""></p>
				<p>如上图中，左侧图片为"晉"字，因此点选比对本"晉"。</p>
				<h5>1.2.3用户输入字</h5>
				<p class="tc"><img width="920" src="./images/h6.png" alt=""></p>
				<p>如上图中，左侧图片为"汤一"，OCR为"一汤一"，因此点选之后，再把前面的一删除。当然，用户也可以手工输入"汤一"。</p>
				<h5>1.2.4删除非经文文字</h5>
				<p class="tc"><img width="920" src="./images/h7.png" alt=""></p>
				<p>如上图中，OCR文本为藏经图片中的非经文文字，因此点选比对本，表示删除该行文字。所有非经文的文字都应予以删除。</p>
				<h5>1.2.5分页及分栏符</h5>
				<p>文本中，p表示分页符（page），b表示分栏符（block）。不需要删除，应保留。</p>
				<h5>1.2.6存疑</h5>
				<p class="tc"><img width="920" src="./images/h8.png" alt=""></p>
				<p>文字校对过程中，有时候虽然给出了校对结果，但是并无百分百的把握，对此结果仍然有所怀疑，这种情况可以进行存疑。用户用鼠标选中存疑的一个或多个文字，然后点击存疑按钮，在弹框中输入存疑理由，然后点击确认，即可保存一条存疑信息。</p>
				<p>所有存疑的信息，将会交给下一个环节继续处理。</p>
				<h4>1.3校对步骤</h4>
				<p>1. 根据1.2节的描述，将所有红色的异文都校对完。</p>
				<p>2. 校对完成之后，可以将删除符隐藏，然后浏览下文本区域看看是否有地方文本没有对齐。藏经中每列字数有规定，校对完成后，大部分文本应该是整齐的。对于应该对齐而多字或者少字的地方，需要额外检查下，避免前面校对操作过程的疏漏。</p>
				<h3>2.校勘判取</h3>
				<p>校勘是通过对同一部经多个版本的横向比对，针对异文再进行人工判取的过程。通过校勘可以得到一份更加准确的版本。校对是为了得到一份与图片一致的电子文本不同，校勘的目的是为了得到一份更加准确的版本。</p>
				<p>校勘的总体流程与文字校对类似：两个并行的校一、校二任务，之后在校一、校二基础上进行一次审定。</p>
				<h4>2.1操作界面介绍</h4>
				<p class="tc"><img width="920" src="./images/h9.png" alt=""></p>
				<p>如上图中，上半部分为经文内容，异文以红色高亮显示。用户可以打开或者关闭参考标点。</p>
				<p>下半部分是校勘列表，每个灰色方框对应与经文中的一个异文。每个方框包含4行。</p>
				<p>第1行：异文文本以及查看列图按钮。</p>
				<p>第2行：归并同类项后显示每个版本分别作什么字。点击各个版本，可以查看该版本完整的图片和文字，并高亮显示异文用字。</p>
				<p>第3行：操作按钮。判取，选择认为正确的字。合并，将多条临近的校勘记合并为一条。拆分，将一条文本较长的校勘记拆分为多条。</p>
				<p>第4行：处理结果，包括判取、合并、拆分等结果。</p>
				<h4>2.2功能说明</h4>
				<h5>2.2.1查看列图</h5>
				<p class="tc"><img width="920" src="./images/h10.png" alt=""></p>
				<p>点击"查看列图"按钮，将弹出浮层显示各个版本的列图，并且将异文用红色方框显示出来，以便用户非常直观的在图片间直接进行比对。</p>
				<h5>2.2.2判取</h5>
				<p class="tc"><img width="920" src="./images/h11.png" alt=""></p>
				<p>针对异文进行判取。在弹框中，用户可以选择认为正确的结果。对于没有把握的地方，还可以注明存疑理由。</p>
				<p>所有存疑的判取结果，都将交给下一个环节进行处理。</p>
				<h5>2.2.3 合并</h5>
				<p class="tc"><img width="920" src="./images/h12.png" alt=""></p>
				<p>有时候，为了使得校勘记的异文更加具有可读性，将临近的两条或多条校勘记进行合并。</p>
				<p>注意，这个合并只是形式上的合并，是为了最终撰写校勘记而使用的，并不会在校勘列表中真正将两条校勘记合并到一起。</p>
				<h5>2.2.4拆分</h5>
				<p class="tc"><img width="920" src="./images/h13.png" alt=""></p>
				<p>当一个校勘记中的异文较长时，为了撰写校勘记方便，会一段较长的异文拆分为多条相对短一些的异文。如上图中，用户可以选择新增或者减少拆分的校勘记的条数。</p>
				<p>注意，这个拆分只是形式上的拆分，是为了最终撰写校勘记而使用的，并不会在校勘列表中真正将一条校勘记拆分为多条。</p>
				<h5>2.2.5提交</h5>
				<p class="tc"><img width="920" src="./images/h14.png" alt=""></p>
				<p>当所有的校勘记都处理完，可以点击提交，提交并完成任务。</p>
				<h3>3.基础标点</h3>
				<p>基础标点指的是在未形成最终的校勘版本的文本之前，可以选择底本经过文字校对后的电子定本或者CBETA、高丽藏等电子文本进行标点。</p>
				<p>基础标点的总体流程与文字校对类似：两个并行的标一、标二任务，之后在标一、标二基础上进行一次审定。</p>
				<p class="tc"><img width="920" src="./images/h15.png" alt=""></p>
				<p>上图中，红色表示用户自己的标点，绿色表示参考标点（可以打开或者关闭）。</p>
				<p>为了避免用户误操作，程序控制用户不可以删除正文以及参考标点，仅支持用户输入汉字标点"<em class="fb">！。、？，；：</em>"等七种标点，以及对换行符的增加和删除操作。</p>
				<p>未完成任务时，用户可以点击暂存，以便下次可以继续。完成任务后，可以点击完成，将任务提交给系统。</p>
            </div>
        </div>
    </div>
</template>
<script></script>
